tutorials/zdlbTests/1-feature/pimpleFoamBalance/cavity/Allrun.parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication decomposePar

runParallel -o postProcess -func processorField

runParallel -o $(getApplication)

runParallel -s "final" postProcess -func processorField

#------------------------------------------------------------------------------
